Revit 2024 API
BuiltInFailures.OpeningFailures.OpeningDoesnotCutHost Property
 Opening does not cut its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId OpeningDoesnotCutHost { get; }
Visual Basic
Public Shared ReadOnly Property OpeningDoesnotCutHost As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ OpeningDoesnotCutHost {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace